Revit 2026 API

# TrussMemberInfo Class

---

Provides access to the information of a truss member in Autodesk Revit.

SystemObject Autodesk.Revit.DB.StructureTrussMemberInfo

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TrussMemberInfo
```
```vb
Public Class TrussMemberInfo
```
```cpp
public ref class TrussMemberInfo
```
```fsharp
type TrussMemberInfo = class end
```

The TrussMemberInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TrussMemberInfo | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | hostTrussId | The host truss' ElementId of the member. |
|  | lockedToTruss | Whether the member is locked to the host truss. |
|  | memberTypeKey | Kind of the member in the truss. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A struct TrussMemberInfo that contains an element's host truss, whether to lock to the truss, usage type, etc.

#### Reference

Autodesk.Revit.DB.Structure Namespace